ci-kop-risalah/app/Controllers/anggota.php

SELECT *
FROM `anggota`
---
    public function index()
    {
        $data['anggota'] = $this->anggotaModel->findAll();