ci-kop-risalah/app/Controllers/Auth.php

    public function login_action()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Cari user berdasarkan username
        $user = $this->userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'caca'
 LIMIT 1