ci-kop-risalah/app/Controllers/d_angsuran.php

SELECT `data_angsuran`.*, `anggota`.`nama_anggota`
FROM `data_angsuran`
LEFT JOIN `anggota` ON `anggota`.`nomor_anggota` = `data_angsuran`.`nomor_anggota`
WHERE `data_angsuran`.`nomor_anggota` = '231231'
---
    public function index()
    {
        $role = strtolower(session()->get('role'));
        $nomorAnggota = session()->get('nomor_anggota');

        $db      = \Config\Database::connect();
        // Gunakan 'data_angsuran' sesuai isi file Model kamu
        $builder = $db->table('data_angsuran');

        // Ambil semua dari data_angsuran + nama dari tabel anggota
        $builder->select('data_angsuran.*, anggota.nama_anggota');
        $builder->join('anggota', 'anggota.nomor_anggota = data_angsuran.nomor_anggota', 'left');

        if ($role !== 'admin') {
            $builder->where('data_angsuran.nomor_anggota', $nomorAnggota);
        }

        $angsuran = $builder->get()->getResultArray();

SELECT *
FROM `anggota`
---

        return view('data-angsuran', [
            'angsuran' => $angsuran,
            'anggota'  => $this->anggotaModel->findAll()