ci-kop-risalah/app/Controllers/iuran.php

    public function index()
    {
        $anggotaModel = new m_anggota();
        $role = strtolower(session()->get('role'));
        $nomorAnggota = session()->get('nomor_anggota');

        $data['anggota'] = $anggotaModel
            ->select('nomor_anggota, nama_anggota')
            ->orderBy('nama_anggota', 'ASC')
            ->findAll();

        $queryIuran = $this->iuranModel
            ->select('
                data_iuran.id_iuran,
                data_iuran.nomor_anggota,
                anggota.nama_anggota,
                data_iuran.iuran_pokok,
                data_iuran.iuran_wajib,
                data_iuran.iuran_sukarela,
                data_iuran.tanggal_iuran
            ')
            ->join('anggota', 'anggota.nomor_anggota = data_iuran.nomor_anggota');
---
SELECT `nomor_anggota`, `nama_anggota`
FROM `anggota`
ORDER BY `nama_anggota` ASC
SELECT `data_iuran`.`id_iuran`, `data_iuran`.`nomor_anggota`, `anggota`.`nama_anggota`, `data_iuran`.`iuran_pokok`, `data_iuran`.`iuran_wajib`, `data_iuran`.`iuran_sukarela`, `data_iuran`.`tanggal_iuran`
FROM `data_iuran`
JOIN `anggota` ON `anggota`.`nomor_anggota` = `data_iuran`.`nomor_anggota`
WHERE `data_iuran`.`nomor_anggota` = '231231'