ci-kop-risalah/app/Controllers/Member.php

    public function index()
    {
        $session = session();
        $db = \Config\Database::connect();

        $builder = $db->table('users');
        $builder->select('users.*, anggota.nama_anggota');
        $builder->join('anggota', 'anggota.nomor_anggota = users.nomor_anggota', 'left');

        $userRole = strtolower($session->get('role') ?? '');

        if ($userRole === 'admin') {
            $data['anggota'] = $builder->get()->getResultArray();
        } else {
            $data['anggota'] = $builder->where('users.id', $session->get('id_user'))->get()->getResultArray();
        }

        $data['list_anggota'] = $this->anggotaModel->findAll();
---
SELECT `users`.*, `anggota`.`nama_anggota`
FROM `users`
LEFT JOIN `anggota` ON `anggota`.`nomor_anggota` = `users`.`nomor_anggota`
SELECT *
FROM `anggota`