ci-kop-risalah/app/Controllers/Profile.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('auth'));
        }

        $userModel = new m_user();
        $data = [
            'title' => 'Profil Saya',
            'user'  => $userModel->find(session()->get('id_user'))
---
SELECT *
FROM `users`
WHERE `users`.`id` = '5'

    public function update()
    {
        $userModel = new m_user();
        $id = session()->get('id_user');
        $data = [
            'nama_lengkap' => $this->request->getPost('nama_lengkap'),
            'username'     => $this->request->getPost('username'),
        ];

        $passBaru = $this->request->getPost('password_baru');
        if (!empty($passBaru)) {
            $data['password'] = password_hash($passBaru, PASSWORD_BCRYPT);
        }

        $userModel->update($id, $data);
---
UPDATE `users` SET `nama_lengkap` = 'Shasah', `username` = 'caca'
WHERE `users`.`id` IN ('5')