ci-kop-risalah/app/Controllers/usaha.php

SELECT *
FROM `data_usaha`
---
    public function index()
    {
        $data['usaha'] = $this->usahaModel->findAll();